Autodesk.Revit.DB.Structure.ReleaseType
The release type.
Since:
2016
Since:
2016

Autodesk.Revit.DB.Structure.ReleaseType.UserDefined
User Defined.

Autodesk.Revit.DB.Structure.ReleaseType.BendingMoment
Bending Moment.

Autodesk.Revit.DB.Structure.ReleaseType.Pinned
Pinned.

Autodesk.Revit.DB.Structure.ReleaseType.Fixed
Fixed.